IDS_DGN_MEMB_USE_TYPE_DWGREP                  = "設計圖&&報告書"
IDS_DGN_MEMB_USE_TYPE_DRAWING                 = "設計圖"     
IDS_DGN_MEMB_USE_TYPE_REPORT                  = "報告書"     
IDS_DGN_MEMB_USE_TYPE_NONE                    = "不輸出"     
IDS_DGN_MEMB_USE_TYPE_MEMBER                  = "依構件"

IDS_DGN_MEMB_GIRDER                           = "梁"
IDS_DGN_MEMB_GIRDER_MAIN                      = "主梁"
IDS_DGN_MEMB_GIRDER_SUB                       = "副梁"
IDS_DGN_MEMB_BEAM                             = "梁"
IDS_DGN_MEMB_COLUMN                           = "柱"
IDS_DGN_MEMB_COLUMN_LOWER                     = "下方柱"
IDS_DGN_MEMB_COLUMN_UPPER                     = "上方柱"
IDS_DGN_MEMB_BRACKET                          = "托架"
IDS_DGN_MEMB_BRACKET_LOWER                    = "下方托架"
IDS_DGN_MEMB_BRACKET_UPPER                    = "上方托架"
IDS_DGN_MEMB_STIFFENER                        = "加勁材"
IDS_DGN_MEMB_STIFFENER_TOP                    = "上方加勁材"
IDS_DGN_MEMB_STIFFENER_BOT                    = "下方加勁材"
IDS_DGN_MEMB_STIFFENER_WEB                    = "柱腹板加勁材"
IDS_DGN_MEMB_BOLT                             = "螺栓"
IDS_DGN_MEMB_PLATE                            = "Plate"
IDS_DGN_LAYOUT                                = "配置"
IDS_DGN_FORCE                                 = "外力"
IDC_DGN_CHK_DRAW_DIMS                      	  = "Draw Dimension"

IDS_DGN_CHK                                   = "選取"
IDS_DGN_CHECK                                 = "檢核"
IDS_DGN_MEMBER_TYPE                           = "構件類型"
IDS_DGN_MEMBER_NAME                           = "構件名稱"

IDS_DGN_FAIL_CREATE_EXCEL                     = "未成功建立Microsoft Excel"
IDS_DGN_FAIL_WRITE_TO_EXCEL                   = "未成功轉換網格至Excel"
IDS_DGN_FAIL_SAVE_AND_OPEN_EXCEL              = "未成功儲存Excel文件"
IDS_DGN_EXPORT_GRID_TO_EXCEL                  = "轉換表格至Excel"
IDS_DGN_NOT_EXIST_DATA_TO_EXPORT_TO_EXCEL     = "請選取要轉換至Excel的資料"

IDS_DGN_EXCEL_EXPORT_LOAD_INFO                = "載重備註"
IDS_DGN_EXCEL_EXPORT_LOAD_DEAD                = "靜載重"
IDS_DGN_EXCEL_EXPORT_LOAD_LIVE                = "活載重"
IDS_DGN_EXCEL_EXPORT_LOAD_SERV                = "使用載重"
IDS_DGN_EXCEL_EXPORT_LOAD_FACT                = "因數載重"
IDS_DGN_EXCEL_EXPORT_LOAD_SUM                 = "加總"

IDS_DGN_EXCEL_BATCHWALL_STORY                 = "樓層"
IDS_DGN_EXCEL_BATCHWALL_SECTION               = "斷面"
IDS_DGN_EXCEL_BATCHWALL_MATERIAL              = "材料"
IDS_DGN_EXCEL_BATCHWALL_LW_CONC               = "輕質混凝土"
IDS_DGN_EXCEL_BATCHWALL_FACTOR                = "因數"
IDS_DGN_EXCEL_BATCHWALL_MOMENT                = "彎矩"
IDS_DGN_EXCEL_BATCHWALL_SHEAR                 = "剪力"
IDS_DGN_EXCEL_BATCHWALL_RATIO                 = "比值"
IDS_DGN_EXCEL_BATCHWALL_LENGTH                = "長度"
IDS_DGN_EXCEL_BATCHWALL_VER_BAR               = "垂直鋼筋"
IDS_DGN_EXCEL_BATCHWALL_HOR_BAR               = "水平鋼筋"
IDS_DGN_EXCEL_BATCHWALL_END_BAR               = "端部鋼筋"
IDS_DGN_EXCEL_BATCHWALL_BE_BAR                = "邊界元素鋼筋"
IDS_DGN_EXCEL_BATCHWALL_BAR_NAME              = "號數"
IDS_DGN_EXCEL_BATCHWALL_BAR_AREA              = "斷面積"
IDS_DGN_EXCEL_BATCHWALL_BAR_SPACE             = "間距"
IDS_DGN_EXCEL_BATCHWALL_BAR_NO                = "數量"
IDS_DGN_EXCEL_BATCHWALL_BAR_NO1               = "數量1"
IDS_DGN_EXCEL_BATCHWALL_BAR_NO2               = "數量2"
IDS_DGN_EXCEL_BATCHWALL_BAR_SMAX              = "最大間距"

IDS_DGN_QUANTITY_BATCHWALL_GENERAL            = "一般"
IDS_DGN_QUANTITY_BATCHWALL_NAME               = "名稱"
IDS_DGN_QUANTITY_BATCHWALL_STORY              = "樓層"
IDS_DGN_QUANTITY_BATCHWALL_SECTION            = "斷面"
IDS_DGN_QUANTITY_BATCHWALL_REBAR              = "鋼筋"
IDS_DGN_QUANTITY_BATCHWALL_VER_BAR            = "垂直筋"
IDS_DGN_QUANTITY_BATCHWALL_HOR_BAR            = "水平筋"
IDS_DGN_QUANTITY_BATCHWALL_END_BAR            = "端部筋"
IDS_DGN_QUANTITY_BATCHWALL_QUANTITY           = "數量"
IDS_DGN_QUANTITY_BATCHWALL_CONCRETE           = "混凝土"
IDS_DGN_QUANTITY_BATCHWALL_SUM                = "加總"
IDS_DGN_QUANTITY_BATCHWALL_TOTAL              = "總計"

IDS_DGN_QUANTITY_NOT_EXIST_DATA               = "無設計結果可供數量計算"

IDS_DGN_CALC_FAIL                             = "未成功執行構件設計"
IDS_DGN_OPT_CHANGE_STEEL_SECTION_LIST         = "型鋼資料庫已變更\n要重設鋼構選項內的斷面清單嗎?"
IDS_DGN_OPT_CHANGE_ALUMINUM_SECTION_LIST      = "鋁構材斷面資料庫已變更\n要重設鋁構材選項內的斷面清單嗎?"

IDS_DGN_NOT_SELECT_DATA                       = "未選取欲設計的元件或位置"
IDS_DGN_NOT_SELECT_NODE                       = "未選取節點"
IDS_DGN_NOT_INPUT_SECTNAME                    = "要進行檢核的構件名稱不存在"
IDS_DGN_NOT_SELECT_UMD                        = "未選取物件"
IDS_DGN_NO_SELECTED_SECTION                   = "[錯誤] 未選取斷面"
IDS_DB_UPLINK_PROGRAM_GUID_NOT_MATCH          = "Batch Wall may have been created in other file.\n\nDo you want to update wall data?"
IDS_DGN_NOT_VALID_PROGRAM_RGW                 = "Batch Wall is created by Gen NOT supporting Export.\nGen V940 / Design+ V490 or Above support Export."
IDS_DGN_NOT_EXIST_RBB                         = "Batch Beam Data is NOT Exist."
IDS_DGN_NOT_EXIST_RBC                         = "Batch Column Data is NOT Exist."
IDS_DGN_NOT_EXIST_RGW                         = "Batch Wall Data is NOT Exist."

IDS_DGN_NOT_EXIST_RC_COLUMN                   = "無RC柱資料可供轉換"
IDS_DGN_CONVERT_COLUMN_RCSRC                  = "RC柱->SRC柱"
IDS_DGN_CONVERT_COLUMN_RCGSC                  = "RC柱->任意斷面柱"
IDS_DGN_CONVERT_TO_GUSCO                      = "轉換至SRC柱"
IDS_DGN_CONVERT_TO_GUCCO                      = "轉換至任意斷面柱"

IDS_DGN_NOT_DRAW_DATA_ERROR                   = "無法產生設計圖"
IDS_DGN_INVALID_FORMULA                       = "不合適的方程式"
IDS_DGN_CHARACTER_EXIST                       = "字元已存在"
IDS_DGN_BIG_VALUE                             = "數值過大"
IDS_DGN__ADDD__Integer_Is_Required            = "請輸入整數"
IDS_DGN__ADDD___CCMLoadCaseGrid__ValidateField__  = "<CCMLoadCaseGrid::ValidateField> 錯誤: 柱ID超出範圍!"
IDS_DGN__ADDD___has_not_been_entered_         = " 尚未輸入"

IDS_DGN_CELL_DELETED_DATA_IS_INCORRECT_SPECIFY_CELL_AGAIN  = "未正確選擇欲刪除的資料格，請重新選取"
IDS_DGN_CELL_INSERTED_IS_INCORRECT_SPECIFY_CELL_AGAIN  = "未正確選擇欲插入的資料格，請重新選取"

IDS_DGN_OPTION_INVALID_MESSAGE                = "設計選項內的參數有誤，請參閱訊息欄內容"
IDS_DGN_DATABASE_INVALID_MESSAGE              = "There is error in Data Base data. Check the message window."
IDS_DGN_REBAR_INVALID_MESSAGE                 = "There is error in Rebar data. Check the message window."
IDS_DGN_STL_OPTION_INVALID_MESSAGE            = "鋼構選項內的參數有誤，請參閱訊息欄內容"
IDS_DGN_ALU_OPTION_INVALID_MESSAGE            = "鋁構選項內的參數有誤，請參閱訊息欄內容"

IDS_DGN_COVER_OPT_DLG_CAPTION                 = "修正資料庫數據"
IDS_DGN_COVER_OPT_CHANGED                     = "已修改保護層厚度的設定."
IDS_DGN_COVER_OPT_CHANGE_DB_DATA              = "要同步變更專案內的數值嗎?"
IDS_DGN_COVER_DATA_CHANGE_GSLAB               = "變更RC樓版參數"
IDS_DGN_COVER_DATA_CHANGE_GURBE               = "變更RC梁參數"
IDS_DGN_COVER_DATA_CHANGE_GURCO               = "變更RC柱參數"
IDS_DGN_COVER_DATA_CHANGE_GURGC               = "變更RC任意斷面柱參數"
IDS_DGN_COVER_DATA_CHANGE_GURSW               = "變更RC剪力牆參數"
IDS_DGN_COVER_DATA_CHANGE_GURSF               = "變更RC連續基礎參數"
IDS_DGN_COVER_DATA_CHANGE_GURDW               = "變更RC組合牆參數"
IDS_DGN_COVER_DATA_CHANGE_GUFDN               = "變更RC基礎參數"
IDS_DGN_COVER_DATA_CHANGE_GUCBF               = "變更RC聯合基礎參數"
IDS_DGN_COVER_DATA_CHANGE_GURCF               = "變更RC聯合基礎參數"
IDS_DGN_COVER_DATA_CHANGE_GURBW               = "變更RC地下室外牆參數"
IDS_DGN_COVER_DATA_CHANGE_GURBU               = "變更RC扶壁參數"
IDS_DGN_COVER_DATA_CHANGE_GURST               = "變更RC樓梯參數"
IDS_DGN_COVER_DATA_CHANGE_GURCB               = "變更RC托梁/托架參數"
IDS_DGN_COVER_DATA_CHANGE_GURBL               = "變更RC梁表格參數"
IDS_DGN_COVER_DATA_CHANGE_GURSL               = "變更RC樓版表格參數"
IDS_DGN_COVER_DATA_CHANGE_GURRW               = "變更RC擋土牆參數"
IDS_DGN_COVER_DATA_CHANGE_GBWUW               = "變更RC批量牆參數"
IDS_DGN_COVER_DATA_CHANGE_GUCCO               = "變更SRC柱參數"
IDS_DGN_COVER_DATA_CHANGE_GUFSL               = "Change RC Slab Reinforce Data"
IDS_DGN_COVER_DATA_CHANGE_GUFBE               = "Change RC Beam Reinforce Data"
IDS_DGN_COVER_DATA_CHANGE_GURAB               = "Change RC Anchor Bolt Data"

IDS_DGN_OPTION_RC_MESSAGE_HEADER              = "[RC設計選項檢查結果]"
IDS_DGN_OPTION_STEEL_MESSAGE_HEADER           = "[鋼構設計選項檢查結果]"
IDS_DGN_OPTION_SRC_MESSAGE_HEADER             = "[SRC設計選項檢查結果]"
IDS_DGN_OPTION_CFS_MESSAGE_HEADER             = "[冷軋型鋼設計選項檢查結果]"

IDS_DGN_OPTION_INVALID_CODE_NAME              = "Design+尚未支援 %s 規範"
IDS_DGN_OPTION_INVALID_RATIO_BENDING          = "不合適的設計檢核比值上限 : 撓曲 < 0"
IDS_DGN_OPTION_INVALID_RATIO_COMPRESSION      = "不合適的設計檢核比值上限 : 壓力 < 0"
IDS_DGN_OPTION_INVALID_RATIO_TENSION          = "不合適的設計檢核比值上限 : 拉力 < 0"
IDS_DGN_OPTION_INVALID_RATIO_SHEAR            = "不合適的設計檢核比值上限 : 剪力&扭力 < 0"
IDS_DGN_OPTION_INVALID_RATIO_OTHERS           = "不合適的設計檢核比值上限 : 其他 < 0"

IDS_DGN_KFACTOR_TYPE_PINPIN                   = "Pin-Pin"
IDS_DGN_KFACTOR_TYPE_FIXFIX                   = "Fix-Fix"
IDS_DGN_KFACTOR_TYPE_PINFIX                   = "Pin-Fix"
IDS_DGN_KFACTOR_TYPE_CANTILEVER               = "Cantilever"
IDS_DGN_KFACTOR_TYPE_USER                     = "User"

IDS_DGN_PREF_DRAW_LIST_NAME                   = "名稱"
IDS_DGN_PREF_DRAW_LIST_COLOR                  = "顏色"
IDS_DGN_PREF_DRAW_LIST_LINETYPE               = "線型"
IDS_DGN_PREF_DRAW_LIST_NOTE                   = "備註"

IDS_DGN_EXPORT_REPORT_DET                     = "正在匯出報表 [ 詳細計算, %s ]"
IDS_DGN_EXPORT_REPORT_SUM                     = "正在匯出報表 [ 設計摘要, %s ]"
IDS_DGN_EXPORT_REPORT_INP                     = "正在匯出報表 [ 計算參數, %s ]"
IDS_DGN_EXPORT_QUICK_DET                      = "正在匯出報表 [ 詳細計算, %s ]"
IDS_DGN_EXPORT_QUICK_SUM                      = "正在匯出報表 [ 設計摘要, %s ]"
IDS_DGN_EXPORT_QUICK_INP                      = "正在匯出報表 [ 計算參數, %s ]"
IDS_DGN_QUICK_REPORT_CREATEION_ERROR          = "無資料可供報表製作\n 已中止產生"
IDS_DGN_EXPORT_FAIL_CREATE_FOLDER             = "無法新增資料夾，請檢查資料夾名稱"

IDS_DGN_TABLE_HEAD_SERIAL_NO                  = "編號"
IDS_DGN_TABLE_HEAD_SIZE                       = "尺寸"
IDS_DGN_TABLE_HEAD_LEGNO                      = "Leg No."
IDS_DGN_TABLE_HEAD_RATIO                      = "比值"
IDS_DGN_TABLE_HEAD_SPAN                       = "跨度"
IDS_DGN_TABLE_HEAD_DISTANCE                   = "距離"

DGN_FORCE_DLG_NOTICE_ALU_MTCHK                = "LCB1將在檢核/設計完成後，以主控的載重組合取代之"
DGN_FORCE_DLG_NOTICE_STL_SGCHK                = "LCB1將在檢核/設計完成後，以主控的載重組合取代之"
DGN_FORCE_DLG_NOTICE_STL_BPCHK                = "LCB1將在檢核/設計完成後，以主控的載重組合取代之"
DGN_FORCE_DLG_NOTICE_RCS_FNCHK                = "LCB1將在檢核/設計完成後，以主控的載重組合取代之"
DGN_FORCE_DLG_NOTICE_RCS_GCCHK                = "LCB0是分別由P-M強度與剪力強度的主控力量組合而成"
IDS_DGN_PREF_GENERAL_NOTICE                   = "柱(RC, SRC)一律使用混凝土表面至鋼筋中心的距離做為保護層厚度"
DGN_FORCE_DLG_LCOM_DESCRIPTION                = "描述"
DGN_FORCE_DLG_LCOM_NO2                        = "不合適的載重組合設定 : 載重組合數量 < 2"
DGN_FORCE_DLG_LCOM_ACTIVE                     = "至少須啟用一組載重組合\n\n請勾選要啟用的載重組合"

IDS_DGN_EXPORT_SELECT_FOLDER                  = "請選擇匯出資料的儲存位置\n\n(檔案可以DWG, EMF, BMP與JPG格式儲存)"
IDS_DGN_SEC_FILE_FOLDER                       = "請選擇*.sec檔的儲存位置 \n\n(可利用GSD製作*.sec檔)"

IDS_DGN_BASIC_SNOW_LOAD                       = "基本地表雪載重"
IDS_DGN_BASIC_DESIGN_WIND_VELOCITY            = "基本設計風速"
IDS_DGN_ROOF_AVER_HEIGHT                      = "平均屋頂高度"
IDS_DGN_DESIGN_ELEM_LOCA_HEIGHT               = "目標構件的安裝高度"
IDS_DGN_WIND_LOAD_MSG_BUILD_TYPE              = "尚未輸入建物類型"
IDS_DGN_WIND_LOAD_MSG_ROOF_TYPE               = "尚未輸入屋頂類型"
IDS_DGN_WIND_LOAD_MSG_CHECK_POINT             = "尚未輸入檢核點"

IDS_DGN_STIFFENER_SECT_B                      = "加勁材的寬度"
IDS_DGN_STIFFENER_SECT_S                      = "加勁材的間距"
IDS_DGN_STIFFENER_FORCE_V                     = "集中力"
IDS_DGN_STIFFENER_FORCE_M                     = "集中力施加位置的額外彎矩"
IDS_DGN_STIFFENER_FORCE_B                     = "集中力的側支撐長度"
IDS_DGN_STIFFENER_FORCE_D                     = "集中力至支承位置(即構件端部)的距離"

IDS_DGN_TORSION_FORCE_POSITION                = "集中力至支承位置(即構件端部)的距離"

IDS_DGN_QUANTITY_SIZE_N                       = "尺寸\n"
IDS_DGN_QUANTITY_STIRRUP_N                    = "箍筋\n"
IDS_DGN_QUANTITY_TRANSVERSE_N                 = "水平筋\n"
IDS_DGN_QUANTITY_CONCRETE_N                   = "混凝土\n"
IDS_DGN_QUANTITY_FORM_N                       = "模板\n"
IDS_DGN_QUANTITY_TOP_N                        = "上方\n"
IDS_DGN_QUANTITY_BOTTOM_N                     = "下方\n"
IDS_DGN_QUANTITY_SUM_N                        = "加總\n"
IDS_DGN_QUANTITY_GENERATE_STRIP_FOOTING_EXCEL_FILE  = "正在產生連續基礎的工程數量excel檔"
IDS_DGN_QUANTITY_TOTAL_N                      = "總計\n"
IDS_DGN_NOT_EXIST_RC_COMBINED_WALL            = "無RC組合牆的資料"

// UNIT CONVERTER (Tab)
IDS_DGN_UNIT_TAB_NAME_COM1                    = "常用-1"
IDS_DGN_UNIT_TAB_NAME_COM2                    = "常用-2"
IDS_DGN_UNIT_TAB_NAME_THER                    = "熱力"
IDS_DGN_UNIT_TAB_NAME_ELEC                    = "電力"
IDS_DGN_UNIT_TAB_NAME_MISC                    = "其他"

// UNIT CONVERTER (Common-1)
IDS_DGN_UNIT_TYPE_STR_ENERG                   = "能量/功"
IDS_DGN_UNIT_TYPE_STR_ENTHA                   = "熱焓"
IDS_DGN_UNIT_TYPE_STR_ENTRO                   = "熱熵"
IDS_DGN_UNIT_TYPE_STR_FORCE                   = "力量/重量"
IDS_DGN_UNIT_TYPE_STR_POWER                   = "功率"
IDS_DGN_UNIT_TYPE_STR_PRESS                   = "壓力/應力"
IDS_DGN_UNIT_TYPE_STR_WDENS                   = "每單位體積重"
IDS_DGN_UNIT_TYPE_STR_TENSN                   = "每單位長度重"
IDS_DGN_UNIT_TYPE_STR_TORQU                   = "彎矩/扭矩"

IDS_DGN_UNIT_STRING_ENERG01                   = "J"
IDS_DGN_UNIT_STRING_ENERG02                   = "kJ"
IDS_DGN_UNIT_STRING_ENERG03                   = "erg"
IDS_DGN_UNIT_STRING_ENERG04                   = "W-h"
IDS_DGN_UNIT_STRING_ENERG05                   = "kW-h"
IDS_DGN_UNIT_STRING_ENERG06                   = "MW-h"
IDS_DGN_UNIT_STRING_ENERG07                   = "kgf-m (kp-m)"
IDS_DGN_UNIT_STRING_ENERG08                   = "gf-cm (p-cm)"
IDS_DGN_UNIT_STRING_ENERG09                   = "cal"
IDS_DGN_UNIT_STRING_ENERG10                   = "kcal"
IDS_DGN_UNIT_STRING_ENERG11                   = "ks-s (ps-s)"
IDS_DGN_UNIT_STRING_ENERG12                   = "ks-h (ps-h)"
IDS_DGN_UNIT_STRING_ENERG13                   = "eV"
IDS_DGN_UNIT_STRING_ENERG14                   = "Mev"
IDS_DGN_UNIT_STRING_ENERG15                   = "ft-pdl"
IDS_DGN_UNIT_STRING_ENERG16                   = "lbf-ft"
IDS_DGN_UNIT_STRING_ENERG17                   = "hp.h"
IDS_DGN_UNIT_STRING_ENERG18                   = "Btu"
IDS_DGN_UNIT_STRING_ENERG19                   = "amu"
IDS_DGN_UNIT_STRING_ENERG20                   = "wavenumber"

IDS_DGN_UNIT_STRING_ENTHA01                   = "J/kg"
IDS_DGN_UNIT_STRING_ENTHA02                   = "kJ/kg"
IDS_DGN_UNIT_STRING_ENTHA03                   = "cal/g"
IDS_DGN_UNIT_STRING_ENTHA04                   = "cal/kg"
IDS_DGN_UNIT_STRING_ENTHA05                   = "kcal/kg"
IDS_DGN_UNIT_STRING_ENTHA06                   = "Btu/lb"

IDS_DGN_UNIT_STRING_ENTRO01                   = "J/kg'C"
IDS_DGN_UNIT_STRING_ENTRO02                   = "kJ/kg'C"
IDS_DGN_UNIT_STRING_ENTRO03                   = "cal/g'C"
IDS_DGN_UNIT_STRING_ENTRO04                   = "cal/kg'C"
IDS_DGN_UNIT_STRING_ENTRO05                   = "kcal/kg'C"
IDS_DGN_UNIT_STRING_ENTRO06                   = "Btu/lb'F"

IDS_DGN_UNIT_STRING_POWER01                   = "W (J/s, Nm/s)"
IDS_DGN_UNIT_STRING_POWER02                   = "kW (kJ/s)"
IDS_DGN_UNIT_STRING_POWER03                   = "erg/s"
IDS_DGN_UNIT_STRING_POWER04                   = "kgf-m/s"
IDS_DGN_UNIT_STRING_POWER05                   = "PS (KS)"
IDS_DGN_UNIT_STRING_POWER06                   = "cal/s"
IDS_DGN_UNIT_STRING_POWER07                   = "kcal/h"
IDS_DGN_UNIT_STRING_POWER08                   = "kcal/min"
IDS_DGN_UNIT_STRING_POWER09                   = "pdl-ft/s"
IDS_DGN_UNIT_STRING_POWER10                   = "lbf-ft/min"
IDS_DGN_UNIT_STRING_POWER11                   = "lbf-ft/s"
IDS_DGN_UNIT_STRING_POWER12                   = "hp"
IDS_DGN_UNIT_STRING_POWER13                   = "Btu/h"
IDS_DGN_UNIT_STRING_POWER14                   = "Btu/min"
IDS_DGN_UNIT_STRING_POWER15                   = "prony"
IDS_DGN_UNIT_STRING_POWER16                   = "rt (ref. ton)"
IDS_DGN_UNIT_STRING_POWER17                   = "US rt (CTR)"

IDS_DGN_UNIT_STRING_FORCE01                   = "N"
IDS_DGN_UNIT_STRING_FORCE02                   = "kN"
IDS_DGN_UNIT_STRING_FORCE03                   = "dyne"
IDS_DGN_UNIT_STRING_FORCE04                   = "pdl (poundal)"
IDS_DGN_UNIT_STRING_FORCE05                   = "lbf"
IDS_DGN_UNIT_STRING_FORCE06                   = "kips"
IDS_DGN_UNIT_STRING_FORCE07                   = "tf"
IDS_DGN_UNIT_STRING_FORCE08                   = "kgf (kp)"
IDS_DGN_UNIT_STRING_FORCE09                   = "p (pond, gf)"
IDS_DGN_UNIT_STRING_FORCE10                   = "ozf"
IDS_DGN_UNIT_STRING_FORCE11                   = "UK tf"

IDS_DGN_UNIT_STRING_PRESS01                   = "Pa (N/m²)"
IDS_DGN_UNIT_STRING_PRESS02                   = "kPa"
IDS_DGN_UNIT_STRING_PRESS03                   = "MPa (N/mm²)"
IDS_DGN_UNIT_STRING_PRESS04                   = "dyne/cm²"
IDS_DGN_UNIT_STRING_PRESS05                   = "bar"
IDS_DGN_UNIT_STRING_PRESS06                   = "tf/cm²"
IDS_DGN_UNIT_STRING_PRESS07                   = "kgf/m² (kp/m²)"
IDS_DGN_UNIT_STRING_PRESS08                   = "kgf/cm² (kp/cm²)"
IDS_DGN_UNIT_STRING_PRESS09                   = "mmAq (mmH20)"
IDS_DGN_UNIT_STRING_PRESS10                   = "inAq (inH20)"
IDS_DGN_UNIT_STRING_PRESS11                   = "ftAq (ftH20)"
IDS_DGN_UNIT_STRING_PRESS12                   = "mmHq (ftH20)"
IDS_DGN_UNIT_STRING_PRESS13                   = "inHg"
IDS_DGN_UNIT_STRING_PRESS14                   = "atm"
IDS_DGN_UNIT_STRING_PRESS15                   = "pdl/ft²"
IDS_DGN_UNIT_STRING_PRESS16                   = "lbf/in² (psi)"
IDS_DGN_UNIT_STRING_PRESS17                   = "lbf/ft² (psf)"
IDS_DGN_UNIT_STRING_PRESS18                   = "kips/in² (ksi)"
IDS_DGN_UNIT_STRING_PRESS19                   = "UK tf/in²"
IDS_DGN_UNIT_STRING_PRESS20                   = "UK tf/ft²"

IDS_DGN_UNIT_STRING_WDENS01                   = "N/m³"
IDS_DGN_UNIT_STRING_WDENS02                   = "kN/m³"
IDS_DGN_UNIT_STRING_WDENS03                   = "N/mm³"
IDS_DGN_UNIT_STRING_WDENS04                   = "kgf/m³"
IDS_DGN_UNIT_STRING_WDENS05                   = "kgf/cm³"
IDS_DGN_UNIT_STRING_WDENS06                   = "tf/cm³"
IDS_DGN_UNIT_STRING_WDENS07                   = "gf/cm³"
IDS_DGN_UNIT_STRING_WDENS08                   = "gf/mm³"
IDS_DGN_UNIT_STRING_WDENS09                   = "tf/m³"
IDS_DGN_UNIT_STRING_WDENS10                   = "tf/yd³"
IDS_DGN_UNIT_STRING_WDENS11                   = "lbf/in³"
IDS_DGN_UNIT_STRING_WDENS12                   = "lbf/ft³"
IDS_DGN_UNIT_STRING_WDENS13                   = "kips/in³"
IDS_DGN_UNIT_STRING_WDENS14                   = "kips/ft³"

IDS_DGN_UNIT_STRING_TENSN01                   = "N/m"
IDS_DGN_UNIT_STRING_TENSN02                   = "kN/m"
IDS_DGN_UNIT_STRING_TENSN03                   = "N/cm"
IDS_DGN_UNIT_STRING_TENSN04                   = "N/mm"
IDS_DGN_UNIT_STRING_TENSN05                   = "tf/m"
IDS_DGN_UNIT_STRING_TENSN06                   = "kgf/cm"
IDS_DGN_UNIT_STRING_TENSN07                   = "lbf/in"
IDS_DGN_UNIT_STRING_TENSN08                   = "kips/ft"
IDS_DGN_UNIT_STRING_TENSN09                   = "lbf/ft (plf)"
IDS_DGN_UNIT_STRING_TENSN10                   = "lbf/yd"
IDS_DGN_UNIT_STRING_TENSN11                   = "dyne/cm"

IDS_DGN_UNIT_STRING_TORQU01                   = "N-m"
IDS_DGN_UNIT_STRING_TORQU02                   = "kN-m"
IDS_DGN_UNIT_STRING_TORQU03                   = "dyne-cm"
IDS_DGN_UNIT_STRING_TORQU04                   = "tf-m"
IDS_DGN_UNIT_STRING_TORQU05                   = "tf-cm"
IDS_DGN_UNIT_STRING_TORQU06                   = "kgf-m (kg-m)"
IDS_DGN_UNIT_STRING_TORQU07                   = "kgf-cm (kp-cm)"
IDS_DGN_UNIT_STRING_TORQU08                   = "pdl-ft"
IDS_DGN_UNIT_STRING_TORQU09                   = "lbf-ft"
IDS_DGN_UNIT_STRING_TORQU10                   = "lbf-in"
IDS_DGN_UNIT_STRING_TORQU11                   = "kips-ft"
IDS_DGN_UNIT_STRING_TORQU12                   = "kips-in"
IDS_DGN_UNIT_STRING_TORQU13                   = "ozf-in"
IDS_DGN_UNIT_STRING_TORQU14                   = "UK tf-ft"

// UNIT CONVERTER (Common-2)
IDS_DGN_UNIT_TYPE_STR_ANGL                    = "角度"
IDS_DGN_UNIT_TYPE_STR_AREA                    = "面積"
IDS_DGN_UNIT_TYPE_STR_DENS                    = "密度"
IDS_DGN_UNIT_TYPE_STR_LENG                    = "長度"
IDS_DGN_UNIT_TYPE_STR_MASS                    = "質量"
IDS_DGN_UNIT_TYPE_STR_TIME                    = "時間"
IDS_DGN_UNIT_TYPE_STR_VELO                    = "速度/速率"
IDS_DGN_UNIT_TYPE_STR_VOLM                    = "體積"

IDS_DGN_UNIT_STRING_ANGL01                    = "Deg"
IDS_DGN_UNIT_STRING_ANGL02                    = "Min"
IDS_DGN_UNIT_STRING_ANGL03                    = "Sec"
IDS_DGN_UNIT_STRING_ANGL04                    = "Rad"
IDS_DGN_UNIT_STRING_ANGL05                    = "Rev"

IDS_DGN_UNIT_STRING_AREA01                    = "m²"
IDS_DGN_UNIT_STRING_AREA02                    = "cm²"
IDS_DGN_UNIT_STRING_AREA03                    = "mm²"
IDS_DGN_UNIT_STRING_AREA04                    = "km²"
IDS_DGN_UNIT_STRING_AREA05                    = "in²"
IDS_DGN_UNIT_STRING_AREA06                    = "ft²"
IDS_DGN_UNIT_STRING_AREA07                    = "yd²"
IDS_DGN_UNIT_STRING_AREA08                    = "rod²"
IDS_DGN_UNIT_STRING_AREA09                    = "mile²"
IDS_DGN_UNIT_STRING_AREA10                    = "a (are)"
IDS_DGN_UNIT_STRING_AREA11                    = "ha (hectare)"
IDS_DGN_UNIT_STRING_AREA12                    = "rood"
IDS_DGN_UNIT_STRING_AREA13                    = "acre"

IDS_DGN_UNIT_STRING_DENS01                    = "kg/m³"
IDS_DGN_UNIT_STRING_DENS02                    = "kg/l"
IDS_DGN_UNIT_STRING_DENS03                    = "kg/cm³"
IDS_DGN_UNIT_STRING_DENS04                    = "g/m³"
IDS_DGN_UNIT_STRING_DENS05                    = "g/l"
IDS_DGN_UNIT_STRING_DENS06                    = "g/cm³"
IDS_DGN_UNIT_STRING_DENS07                    = "g/mm³"
IDS_DGN_UNIT_STRING_DENS08                    = "t/m³"
IDS_DGN_UNIT_STRING_DENS09                    = "t/yd³"
IDS_DGN_UNIT_STRING_DENS10                    = "lb/in³"
IDS_DGN_UNIT_STRING_DENS11                    = "lb/ft³"
IDS_DGN_UNIT_STRING_DENS12                    = "slug/in³"
IDS_DGN_UNIT_STRING_DENS13                    = "Slug/ft³"
IDS_DGN_UNIT_STRING_DENS14                    = "lb/US gal"
IDS_DGN_UNIT_STRING_DENS15                    = "oz/US gal"
IDS_DGN_UNIT_STRING_DENS16                    = "lb/UK gal"
IDS_DGN_UNIT_STRING_DENS17                    = "oz/UK gal"

IDS_DGN_UNIT_STRING_LENG01                    = "m"
IDS_DGN_UNIT_STRING_LENG02                    = "cm"
IDS_DGN_UNIT_STRING_LENG03                    = "mm"
IDS_DGN_UNIT_STRING_LENG04                    = "km"
IDS_DGN_UNIT_STRING_LENG05                    = "in"
IDS_DGN_UNIT_STRING_LENG06                    = "ft"
IDS_DGN_UNIT_STRING_LENG07                    = "mile"
IDS_DGN_UNIT_STRING_LENG08                    = "US mile"
IDS_DGN_UNIT_STRING_LENG09                    = "UK mile"
IDS_DGN_UNIT_STRING_LENG10                    = "Light Year"
IDS_DGN_UNIT_STRING_LENG11                    = "Furlong"
IDS_DGN_UNIT_STRING_LENG12                    = "Fathom"
IDS_DGN_UNIT_STRING_LENG13                    = "rod"
IDS_DGN_UNIT_STRING_LENG14                    = "Parsec"
IDS_DGN_UNIT_STRING_LENG15                    = "Angstrom"
IDS_DGN_UNIT_STRING_LENG16                    = "chain"
IDS_DGN_UNIT_STRING_LENG17                    = "Ja"
IDS_DGN_UNIT_STRING_LENG18                    = "Ri"
IDS_DGN_UNIT_STRING_LENG19                    = "yard"

IDS_DGN_UNIT_STRING_MASS01                    = "kg"
IDS_DGN_UNIT_STRING_MASS02                    = "g"
IDS_DGN_UNIT_STRING_MASS03                    = "mg"
IDS_DGN_UNIT_STRING_MASS04                    = "water drop"
IDS_DGN_UNIT_STRING_MASS05                    = "lb"
IDS_DGN_UNIT_STRING_MASS06                    = "slug"
IDS_DGN_UNIT_STRING_MASS07                    = "oz"
IDS_DGN_UNIT_STRING_MASS08                    = "t"
IDS_DGN_UNIT_STRING_MASS09                    = "UK t"
IDS_DGN_UNIT_STRING_MASS10                    = "US short t"
IDS_DGN_UNIT_STRING_MASS11                    = "amu"
IDS_DGN_UNIT_STRING_MASS12                    = "k (caret)"
IDS_DGN_UNIT_STRING_MASS13                    = "돈"
IDS_DGN_UNIT_STRING_MASS14                    = "근"
IDS_DGN_UNIT_STRING_MASS15                    = "관"

IDS_DGN_UNIT_STRING_TIME01                    = "sec"
IDS_DGN_UNIT_STRING_TIME02                    = "mili sec"
IDS_DGN_UNIT_STRING_TIME03                    = "micro sec"
IDS_DGN_UNIT_STRING_TIME04                    = "nano sec"
IDS_DGN_UNIT_STRING_TIME05                    = "min"
IDS_DGN_UNIT_STRING_TIME06                    = "hour"
IDS_DGN_UNIT_STRING_TIME07                    = "day"
IDS_DGN_UNIT_STRING_TIME08                    = "week"
IDS_DGN_UNIT_STRING_TIME09                    = "month"
IDS_DGN_UNIT_STRING_TIME10                    = "year"

IDS_DGN_UNIT_STRING_VELO01                    = "km/s"
IDS_DGN_UNIT_STRING_VELO02                    = "m/s"
IDS_DGN_UNIT_STRING_VELO03                    = "cm/s"
IDS_DGN_UNIT_STRING_VELO04                    = "mm/s"
IDS_DGN_UNIT_STRING_VELO05                    = "km/h"
IDS_DGN_UNIT_STRING_VELO06                    = "m/h"
IDS_DGN_UNIT_STRING_VELO07                    = "in/s"
IDS_DGN_UNIT_STRING_VELO08                    = "ft/s"
IDS_DGN_UNIT_STRING_VELO09                    = "yd/s"
IDS_DGN_UNIT_STRING_VELO10                    = "mile/s"
IDS_DGN_UNIT_STRING_VELO11                    = "in/min"
IDS_DGN_UNIT_STRING_VELO12                    = "ft/min"
IDS_DGN_UNIT_STRING_VELO13                    = "yd/min"
IDS_DGN_UNIT_STRING_VELO14                    = "yd/h"
IDS_DGN_UNIT_STRING_VELO15                    = "mile/h"
IDS_DGN_UNIT_STRING_VELO16                    = "knot"
IDS_DGN_UNIT_STRING_VELO17                    = "UK knot"

IDS_DGN_UNIT_STRING_VOLM01                    = "m³"
IDS_DGN_UNIT_STRING_VOLM02                    = "l"
IDS_DGN_UNIT_STRING_VOLM03                    = "cm³ (ml, cc)"
IDS_DGN_UNIT_STRING_VOLM04                    = "mm³"
IDS_DGN_UNIT_STRING_VOLM05                    = "water drop"
IDS_DGN_UNIT_STRING_VOLM06                    = "in³"
IDS_DGN_UNIT_STRING_VOLM07                    = "ft³"
IDS_DGN_UNIT_STRING_VOLM08                    = "yd³"
IDS_DGN_UNIT_STRING_VOLM09                    = "US bushel"
IDS_DGN_UNIT_STRING_VOLM10                    = "US lig pt"
IDS_DGN_UNIT_STRING_VOLM11                    = "US gal"
IDS_DGN_UNIT_STRING_VOLM12                    = "US fl oz"
IDS_DGN_UNIT_STRING_VOLM13                    = "UK bushel"
IDS_DGN_UNIT_STRING_VOLM14                    = "UK pt"
IDS_DGN_UNIT_STRING_VOLM15                    = "UK fl oz"
IDS_DGN_UNIT_STRING_VOLM16                    = "bbl (oil)"
IDS_DGN_UNIT_STRING_VOLM17                    = "quart"

// UNIT CONVERTER (Thermal)
IDS_DGN_UNIT_TYPE_STR_HCAPA                   = "熱容量"
IDS_DGN_UNIT_TYPE_STR_HFLUX                   = "熱通量"
IDS_DGN_UNIT_TYPE_STR_HTRAN                   = "導熱係數"
IDS_DGN_UNIT_TYPE_STR_HRADI                   = "輻射常數"
IDS_DGN_UNIT_TYPE_STR_HSPEC                   = "比熱"
IDS_DGN_UNIT_TYPE_STR_HCOND                   = "熱傳導係數"

IDS_DGN_UNIT_STRING_HCAPA01                   = "J/'C"
IDS_DGN_UNIT_STRING_HCAPA02                   = "kJ/'C"
IDS_DGN_UNIT_STRING_HCAPA03                   = "cal/'C"
IDS_DGN_UNIT_STRING_HCAPA04                   = "kcal/'C"
IDS_DGN_UNIT_STRING_HCAPA05                   = "BTU/'F"

IDS_DGN_UNIT_STRING_HFLUX01                   = "W/m²"
IDS_DGN_UNIT_STRING_HFLUX02                   = "kW/m²"
IDS_DGN_UNIT_STRING_HFLUX03                   = "W/cm²"
IDS_DGN_UNIT_STRING_HFLUX04                   = "kW/cm²"
IDS_DGN_UNIT_STRING_HFLUX05                   = "kcal/m².h"
IDS_DGN_UNIT_STRING_HFLUX06                   = "cal/cm².s"
IDS_DGN_UNIT_STRING_HFLUX07                   = "Btu/in².s"
IDS_DGN_UNIT_STRING_HFLUX08                   = "Btu/ft².s"
IDS_DGN_UNIT_STRING_HFLUX09                   = "Btu/ft².h"

IDS_DGN_UNIT_STRING_HTRAN01                   = "W/m²'C"
IDS_DGN_UNIT_STRING_HTRAN02                   = "kW/m²'C"
IDS_DGN_UNIT_STRING_HTRAN03                   = "W/cm²'C"
IDS_DGN_UNIT_STRING_HTRAN04                   = "kcal/m².h.'C"
IDS_DGN_UNIT_STRING_HTRAN05                   = "cal/cm².s.'C"
IDS_DGN_UNIT_STRING_HTRAN06                   = "Btu/ft².h.'F"

IDS_DGN_UNIT_STRING_HRADI01                   = "W/m².K⁴"
IDS_DGN_UNIT_STRING_HRADI02                   = "kw/m².K⁴"
IDS_DGN_UNIT_STRING_HRADI03                   = "W/cm².K⁴"
IDS_DGN_UNIT_STRING_HRADI04                   = "kcal/m².h.K⁴"
IDS_DGN_UNIT_STRING_HRADI05                   = "cal/cm².s.K⁴"
IDS_DGN_UNIT_STRING_HRADI06                   = "Btu/ft.h.K⁴"

IDS_DGN_UNIT_STRING_HSPEC01                   = "J/kg'C"
IDS_DGN_UNIT_STRING_HSPEC02                   = "kJ/kg'C"
IDS_DGN_UNIT_STRING_HSPEC03                   = "cal/kg'C"
IDS_DGN_UNIT_STRING_HSPEC04                   = "kcal/kg'C"
IDS_DGN_UNIT_STRING_HSPEC05                   = "cal/g'C"
IDS_DGN_UNIT_STRING_HSPEC06                   = "Btu/lb'F"
IDS_DGN_UNIT_STRING_HSPEC07                   = "Wh/kg'C"
IDS_DGN_UNIT_STRING_HSPEC08                   = "kWh/kg'C"

IDS_DGN_UNIT_STRING_HCOND01                   = "W/m'C"
IDS_DGN_UNIT_STRING_HCOND02                   = "kW/m'C"
IDS_DGN_UNIT_STRING_HCOND03                   = "W/cm'C"
IDS_DGN_UNIT_STRING_HCOND04                   = "kW/cm'C"
IDS_DGN_UNIT_STRING_HCOND05                   = "kcal/hm'C"
IDS_DGN_UNIT_STRING_HCOND06                   = "cal/scm'C"
IDS_DGN_UNIT_STRING_HCOND07                   = "Btu/ft².h.'F"
IDS_DGN_UNIT_STRING_HCOND08                   = "Btu/fth'F"
IDS_DGN_UNIT_STRING_HCOND09                   = "Btu/inh'F"

// UNIT CONVERTER (Electric)
IDS_DGN_UNIT_TYPE_STR_CAPAC                   = "電容"    
IDS_DGN_UNIT_TYPE_STR_CHARG                   = "電荷"    
IDS_DGN_UNIT_TYPE_STR_CURRN                   = "電流"    
IDS_DGN_UNIT_TYPE_STR_POTEN                   = "電勢/電動勢"
IDS_DGN_UNIT_TYPE_STR_INDUC                   = "電感"    
IDS_DGN_UNIT_TYPE_STR_FIELD                   = "磁場"    
IDS_DGN_UNIT_TYPE_STR_MFLUX                   = "磁通量"   
IDS_DGN_UNIT_TYPE_STR_RESIS                   = "電阻"    

IDS_DGN_UNIT_STRING_ECAPA01                   = "F (farad)"
IDS_DGN_UNIT_STRING_ECAPA02                   = "micro F"
IDS_DGN_UNIT_STRING_ECAPA03                   = "pF"
IDS_DGN_UNIT_STRING_ECAPA04                   = "stF"
IDS_DGN_UNIT_STRING_ECAPA05                   = "abF"

IDS_DGN_UNIT_STRING_ECHAR01                   = "C (coulomb)"
IDS_DGN_UNIT_STRING_ECHAR02                   = "abC"
IDS_DGN_UNIT_STRING_ECHAR03                   = "stC"
IDS_DGN_UNIT_STRING_ECHAR04                   = "Ah"
IDS_DGN_UNIT_STRING_ECHAR05                   = "Faraday"

IDS_DGN_UNIT_STRING_ECURR01                   = "A"
IDS_DGN_UNIT_STRING_ECURR02                   = "mA"
IDS_DGN_UNIT_STRING_ECURR03                   = "micro A"
IDS_DGN_UNIT_STRING_ECURR04                   = "stA"
IDS_DGN_UNIT_STRING_ECURR05                   = "abA"

IDS_DGN_UNIT_STRING_EPOTE01                   = "V"
IDS_DGN_UNIT_STRING_EPOTE02                   = "abV"
IDS_DGN_UNIT_STRING_EPOTE03                   = "stV"

IDS_DGN_UNIT_STRING_EINDU01                   = "abH"
IDS_DGN_UNIT_STRING_EINDU02                   = "H (henry)"
IDS_DGN_UNIT_STRING_EINDU03                   = "micro H"
IDS_DGN_UNIT_STRING_EINDU04                   = "mH"
IDS_DGN_UNIT_STRING_EINDU05                   = "stH"

IDS_DGN_UNIT_STRING_EFILD01                   = "gauss"
IDS_DGN_UNIT_STRING_EFILD02                   = "T (tesla)"
IDS_DGN_UNIT_STRING_EFILD03                   = "milli gauss"

IDS_DGN_UNIT_STRING_EFLUX01                   = "maxwell"
IDS_DGN_UNIT_STRING_EFLUX02                   = "Wb (weber)"

IDS_DGN_UNIT_STRING_ERESI01                   = "ab Ohm"
IDS_DGN_UNIT_STRING_ERESI02                   = "Ohm"
IDS_DGN_UNIT_STRING_ERESI03                   = "st Ohm"

// UNIT CONVERTER (Miscellaneous)
IDS_DGN_UNIT_TYPE_STR_MISC_VFLOW              = "體積流量" 
IDS_DGN_UNIT_TYPE_STR_MISC_SVOLM              = "比容"   
IDS_DGN_UNIT_TYPE_STR_MISC_MFLOW              = "質量流量" 
IDS_DGN_UNIT_TYPE_STR_MISC_INERT              = "質量慣性矩"
IDS_DGN_UNIT_TYPE_STR_MISC_TEMPE              = "溫度"   

IDS_DGN_UNIT_STRING_MISC_VFLOW01              = "m³/s"
IDS_DGN_UNIT_STRING_MISC_VFLOW02              = "m³/min"
IDS_DGN_UNIT_STRING_MISC_VFLOW03              = "m³/h"
IDS_DGN_UNIT_STRING_MISC_VFLOW04              = "l/s"
IDS_DGN_UNIT_STRING_MISC_VFLOW05              = "l/min"
IDS_DGN_UNIT_STRING_MISC_VFLOW06              = "l/h"
IDS_DGN_UNIT_STRING_MISC_VFLOW07              = "ft³/s"
IDS_DGN_UNIT_STRING_MISC_VFLOW08              = "ft³/min"
IDS_DGN_UNIT_STRING_MISC_VFLOW09              = "ft³/h"
IDS_DGN_UNIT_STRING_MISC_VFLOW10              = "US gal/s"
IDS_DGN_UNIT_STRING_MISC_VFLOW11              = "US gal/min"
IDS_DGN_UNIT_STRING_MISC_VFLOW12              = "US gal/h"
IDS_DGN_UNIT_STRING_MISC_VFLOW13              = "UK gal/s"
IDS_DGN_UNIT_STRING_MISC_VFLOW14              = "UK gal/min"
IDS_DGN_UNIT_STRING_MISC_VFLOW15              = "UK gal/h"
IDS_DGN_UNIT_STRING_MISC_VFLOW16              = "bbl/h"
IDS_DGN_UNIT_STRING_MISC_VFLOW17              = "bbl/day"

IDS_DGN_UNIT_STRING_MISC_SVOLM01              = "m³/kg"
IDS_DGN_UNIT_STRING_MISC_SVOLM02              = "l/kg"
IDS_DGN_UNIT_STRING_MISC_SVOLM03              = "in³/lb"
IDS_DGN_UNIT_STRING_MISC_SVOLM04              = "ft³/lb"
IDS_DGN_UNIT_STRING_MISC_SVOLM05              = "ft³/slug"
IDS_DGN_UNIT_STRING_MISC_SVOLM06              = "ft³/t"
IDS_DGN_UNIT_STRING_MISC_SVOLM07              = "gal/lb"
IDS_DGN_UNIT_STRING_MISC_SVOLM08              = "UK gal/lb"

IDS_DGN_UNIT_STRING_MISC_MFLOW01              = "kg/s"
IDS_DGN_UNIT_STRING_MISC_MFLOW02              = "kg/min"
IDS_DGN_UNIT_STRING_MISC_MFLOW03              = "kg/h"
IDS_DGN_UNIT_STRING_MISC_MFLOW04              = "g/s"
IDS_DGN_UNIT_STRING_MISC_MFLOW05              = "t/s"
IDS_DGN_UNIT_STRING_MISC_MFLOW06              = "t/min"
IDS_DGN_UNIT_STRING_MISC_MFLOW07              = "t/h"
IDS_DGN_UNIT_STRING_MISC_MFLOW08              = "UK t/h"
IDS_DGN_UNIT_STRING_MISC_MFLOW09              = "lb/s"
IDS_DGN_UNIT_STRING_MISC_MFLOW10              = "lb/min"
IDS_DGN_UNIT_STRING_MISC_MFLOW11              = "lb/h"

IDS_DGN_UNIT_STRING_MISC_INERT01              = "kg-m²"
IDS_DGN_UNIT_STRING_MISC_INERT02              = "kg-cm²"
IDS_DGN_UNIT_STRING_MISC_INERT03              = "g-m²"
IDS_DGN_UNIT_STRING_MISC_INERT04              = "lb-ft²"
IDS_DGN_UNIT_STRING_MISC_INERT05              = "lb-m²"
IDS_DGN_UNIT_STRING_MISC_INERT06              = "oz-m²"

IDS_DGN_UNIT_STRING_MISC_TEMPE01              = "'C"
IDS_DGN_UNIT_STRING_MISC_TEMPE02              = "'F"
IDS_DGN_UNIT_STRING_MISC_TEMPE03              = "K"

// Wind Load Checking ( Simplified Method )
IDS_DGN_WIND_CHCK_OK                          = "OK"
IDS_DGN_WIND_CHCK_NG                          = "NG"
IDS_DGN_WIND_CHCK_SIMP_APP                    = "可套用簡易法"
IDS_DGN_WIND_CHCK_SIMP_NOT                    = "不可套用簡易法"

// Initial Data Setting File Dialog
IDS_DGN_INIT_DATA_FILE_DLG_IMPORT             = "請選擇要匯入的設定檔"
IDS_DGN_INIT_DATA_FILE_DLG_EXPORT             = "請選擇要匯出的設定檔"

/////// Quantity Table
IDC_DGN_QUANTITY_AREA_N                       = "面積\n"
IDC_DGN_QUANTITY_BOT_N                        = "下方\n"
IDC_DGN_QUANTITY_BOTTOM                       = "下方"
IDC_DGN_QUANTITY_BOTTOM_CAP                   = "下方"
IDC_DGN_QUANTITY_BOTTOM_N                     = "下方\n"
IDC_DGN_QUANTITY_BOTTOM_NREBAR                = "下層\n鋼筋"
IDC_DGN_QUANTITY_BOTTOM_NREBAR_N              = "下層\n鋼筋\n"
IDC_DGN_QUANTITY_CENTER                       = "中央"
IDC_DGN_QUANTITY_CONCRETE_N                   = "混凝土\n"
IDC_DGN_QUANTITY_CONCRETE_1_N                 = "混凝土-1\n"
IDC_DGN_QUANTITY_DIR_X                        = "X向"
IDC_DGN_QUANTITY_DIR_Y                        = "Y向"
IDC_DGN_QUANTITY_DIRECTION_X                  = "X向"
IDC_DGN_QUANTITY_DIRECTION_Y                  = "Y向"
IDC_DGN_QUANTITY_END_I_CAP                    = "I端"
IDC_DGN_QUANTITY_END_J_CAP                    = "J端"
IDC_DGN_QUANTITY_END                          = "端部"
IDC_DGN_QUANTITY_END_BAR_N                    = "端部筋\n"
IDC_DGN_QUANTITY_END_N                        = "端部\n"
IDC_DGN_QUANTITY_END_NBAR                     = "端部筋"
IDC_DGN_QUANTITY_END_NBAR_N                   = "端部筋\n"
IDC_DGN_QUANTITY_EXT_N                        = "右側\n"
IDC_DGN_QUANTITY_FOOTING                      = "基礎版"
IDC_DGN_QUANTITY_FORM_N                       = "模板\n"
IDC_DGN_QUANTITY_H_BEAM                       = "H型鋼"
IDC_DGN_QUANTITY_HEIGHT                       = "Height"
IDC_DGN_QUANTITY_HOOP                         = "箍筋"
IDC_DGN_QUANTITY_HOOPBAR                      = "箍筋"
IDC_DGN_QUANTITY_HOR                          = "水平"
IDC_DGN_QUANTITY_HOR_BAR_N                    = "水平筋\n"
IDC_DGN_QUANTITY_HOR_N                        = "水平\n"
IDC_DGN_QUANTITY_INT_N                        = "左側\n"
IDC_DGN_QUANTITY_LANDING_LEFT_CAP             = "平台(左側)"
IDC_DGN_QUANTITY_LANDING_RIGHT_CAP            = "平台(右側)"
IDC_DGN_QUANTITY_LAYER_1                      = "第1層"
IDC_DGN_QUANTITY_LAYER_2                      = "第2層"
IDC_DGN_QUANTITY_LAYER_3                      = "第3層"
IDC_DGN_QUANTITY_LAYER_4                      = "第4層"
IDC_DGN_QUANTITY_LAYER_NO                     = "排數"
IDC_DGN_QUANTITY_LEFT                         = "左側"
IDC_DGN_QUANTITY_LX_N                         = "Lx\n"
IDC_DGN_QUANTITY_LY_N                         = "Ly\n"
IDC_DGN_QUANTITY_MAIN                         = "主筋"
IDC_DGN_QUANTITY_MAIN_N                       = "主筋\n"
IDC_DGN_QUANTITY_MAIN_NBAR                    = "主筋"
IDC_DGN_QUANTITY_MAIN_NBAR_N                  = "主筋\n"
IDC_DGN_QUANTITY_MAINBAR                      = "主筋"
IDC_DGN_QUANTITY_MAINBAR_N                    = "主筋\n"
IDC_DGN_QUANTITY_MIDDLE                       = "中央"
IDC_DGN_QUANTITY_MIDDLE_CAP                   = "中央"
IDC_DGN_QUANTITY_MIDDLE_N                     = "中央\n"
IDC_DGN_QUANTITY_NAME                         = "名稱"
IDC_DGN_QUANTITY_QUANTITY_PER_COMBINED_WALL   = "每組合牆數量"
IDC_DGN_QUANTITY_QUANTITY_PER_UNIT_LENGTH     = "每單位長度數量"
IDC_DGN_QUANTITY_REBAR                        = "鋼筋"
IDC_DGN_QUANTITY_REBAR1_N                     = "鋼筋1\n"
IDC_DGN_QUANTITY_REBAR1_1_N                   = "鋼筋1-1\n"
IDC_DGN_QUANTITY_REBAR1_2_N                   = "鋼筋1-2\n"
IDC_DGN_QUANTITY_REBAR2_N                     = "鋼筋2\n"
IDC_DGN_QUANTITY_REBAR3_N                     = "鋼筋3\n"
IDC_DGN_QUANTITY_RIGHT                        = "右側"
IDC_DGN_QUANTITY_SECTION                      = "斷面"
IDC_DGN_QUANTITY_SIZE_N                       = "尺寸\n"
IDC_DGN_QUANTITY_SKIN                         = "腰筋"
IDC_DGN_QUANTITY_SKIN_N                       = "腰筋\n"
IDC_DGN_QUANTITY_SKIN_NBAR_N                  = "腰筋\n"
IDC_DGN_QUANTITY_STAIR_CAP                    = "階梯"
IDC_DGN_QUANTITY_STEEL_N                      = "鋼構\n"
IDC_DGN_QUANTITY_STIRRUP                      = "箍筋"
IDC_DGN_QUANTITY_STIRRUP_N                    = "箍筋\n"
IDC_DGN_QUANTITY_SUB_N                        = "箍筋\n"
IDC_DGN_QUANTITY_SUM_N                        = "加總\n"
IDC_DGN_QUANTITY_SUM                          = "加總"
IDC_DGN_QUANTITY_TENSION                      = "主拉力"
IDC_DGN_QUANTITY_TENSION_N                    = "主拉力\n"
IDC_DGN_QUANTITY_THICK_N                      = "厚度\n"
IDC_DGN_QUANTITY_TOP                          = "上方"
IDC_DGN_QUANTITY_TOP_CAP                      = "上方"
IDC_DGN_QUANTITY_TOP_N                        = "上方\n"
IDC_DGN_QUANTITY_TOP_NREBAR                   = "上層\n鋼筋"
IDC_DGN_QUANTITY_TOP_NREBAR_N                 = "上層\n鋼筋\n"
IDC_DGN_QUANTITY_TOTAL_CAP                    = "總計"
IDC_DGN_QUANTITY_TOTAL_N                      = "總計\n"
IDC_DGN_QUANTITY_UNIT_WALL                    = "單元牆"
IDC_DGN_QUANTITY_VER                          = "垂直"
IDC_DGN_QUANTITY_VER_BAR_N                    = "垂直筋\n"
IDC_DGN_QUANTITY_VER_N                        = "垂直\n"
IDC_DGN_QUANTITY_POSI_CANT_L                  = "Cant.L"
IDC_DGN_QUANTITY_POSI_CANT_R                  = "Cant.R"
IDC_DGN_QUANTITY_POSI_COLUMN                  = "Colm%d"
IDC_DGN_QUANTITY_POSI_SPAN                    = "Span%d-%d"

IDS_DGN_IMPORT_FILE_NOT_SELECTED              = "File is not Selected."
IDS_DGN_IMPORT_FILE_NOT_OPEN                  = "File is not Opened."
IDS_DGN_IMPORT_PREF_NOT_SELECTED              = "There is no selected preference to import."
IDS_DGN_IMPORT_PREF_SUCCEED                   = "Preference & Design Option imported successfully."
IDS_DGN_IMPORT_PREF_FAILED                    = "Importing preference & design option is failed."

IDS_DGN_MEMB_NOT_SELECTED                     = "Member is not selected."
IDS_DGN_EDIT_ALL_STORY                        = "All Story is selected.\nDo you want to change all stroy?"

/////// DGN_SELECT_UNIT_GRID
IDS_DGN_NUMB_FORM_UNIT_LENGTH                 = "Length"
IDS_DGN_NUMB_FORM_UNIT_FORCE                  = "Force"
IDS_DGN_NUMB_FORM_UNIT_WEIGHT                 = "Weight"
IDS_DGN_NUMB_FORM_UNIT_AREA 				  = "Area"
IDS_DGN_NUMB_FORM_UNIT_VOLUME 			      = "Volume"
IDS_DGN_NUMB_FORM_UNIT_STIF 				  = "Stiffness"
IDS_DGN_NUMB_FORM_UNIT_MOMENT 			      = "Moment"
IDS_DGN_NUMB_FORM_UNIT_UNIT_MOMENT 		      = "Unit Moment"
IDS_DGN_NUMB_FORM_UNIT_UNIT_FORCE 		      = "Unit Force"
IDS_DGN_NUMB_FORM_UNIT_UNIT_LOAD              = "Unit Load"
IDS_DGN_NUMB_FORM_UNIT_SPRING                 = "Spring"
IDS_DGN_NUMB_FORM_UNIT_STRESS 			      = "Stress"
IDS_DGN_NUMB_FORM_UNIT_PRESSURE 			  = "Pressure"
IDS_DGN_NUMB_FORM_UNIT_ELAST 			      = "Elasticity"
IDS_DGN_NUMB_FORM_UNIT_UNIT_SPRING            = "Unit Spring"
IDS_DGN_NUMB_FORM_UNIT_DENSITY                = "Weight Density"
IDS_DGN_NUMB_FORM_UNIT_MASS_DENSITY           = "Mass Density"
IDS_DGN_NUMB_FORM_UNIT_MEMB_LENGTH            = "Member Length"
IDS_DGN_NUMB_FORM_UNIT_DISTRIBUTED_LOAD       = "Distributed Load"
IDS_DGN_NUMB_FORM_UNIT_CONCENTRATED_LOAD      = "Concentrated Load"
IDS_DGN_NUMB_FORM_UNIT_SOIL_CAPACITY 		  = "Soil Capacity"
IDS_DGN_NUMB_FORM_UNIT_PILE_CAPACITY 		  = "Pile Capacity"
IDS_DGN_NUMB_FORM_UNIT_MEMB_VOLUME 		      = "Member Volume"
IDS_DGN_NUMB_FORM_UNIT_MEMB_AREA 			  = "Member Area"
IDS_DGN_NUMB_FORM_UNIT_MEMB_DENSITY 		  = "Member Density"
IDS_DGN_NUMB_FORM_UNIT_SOIL_STIFFNESS 		  = "Soil Stiffness"

IDS_DGN_MSG_UPDATE_MATL_BY_REBAR_DIA          = "Material by Rebar Diameter option is selected.\nDo you want to update the material data?"
IDS_DGN_RESET_TO_DEFAULT                      = "Do you want to reset data by Default?"